Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_PMC.h
#define PMC_PDRUNCFG0_DCDC_MODE_MASK             (0x1800U)
#define PMC_PDRUNCFG0_DCDC_MODE_SHIFT            (11U)
/*! DCDC_MODE - DCDC Power Mode
 *  0b00..Enables DCDC in high-power mode
 *  0b01..Enables DCDC in low-power mode
 *  0b10..Enables DCDC in ultra-low-power mode
 *  0b11..Enables DCDC in ultra-low-power mode
 */
#define PMC_PDRUNCFG0_DCDC_MODE(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_DCDC_MODE_SHIFT)) & PMC_PDRUNCFG0_DCDC_MODE_MASK)

#define PMC_PDRUNCFG0_DCDC_VSEL_MASK             (0x2000U)
#define PMC_PDRUNCFG0_DCDC_VSEL_SHIFT            (13U)
/*! DCDC_VSEL - Select DCDC Voltage
 *  0b0..Selects DCDCVSEL[VSEL0] level
 *  0b1..Selects DCDCVSEL[VSEL1] level
 */
#define PMC_PDRUNCFG0_DCDC_VSEL(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_DCDC_VSEL_SHIFT)) & PMC_PDRUNCFG0_DCDC_VSEL_MASK)

#define PMC_PDRUNCFG0_LDO1_MODE_MASK             (0xC000U)
#define PMC_PDRUNCFG0_LDO1_MODE_SHIFT            (14U)
/*! LDO1_MODE - LDO VDD1 Mode
 *  0b00..Bypass mode
 *  0b01..High-power mode
 *  0b10, 0b11..Low-power mode
 */
#define PMC_PDRUNCFG0_LDO1_MODE(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_LDO1_MODE_SHIFT)) & PMC_PDRUNCFG0_LDO1_MODE_MASK)

#define PMC_PDRUNCFG0_LDO1_VSEL_MASK             (0x30000U)
#define PMC_PDRUNCFG0_LDO1_VSEL_SHIFT            (16U)
/*! LDO1_VSEL - LDO VDD1 Voltage Select
 *  0b00..Selects LDOVDD1VSEL[VSEL0] and LVDVDD1CTRL[LVL0] level
 *  0b01..Selects LDOVDD1VSEL[VSEL1] and LVDVDD1CTRL[LVL1] level
 *  0b10..Selects LDOVDD1VSEL[VSEL2] and LVDVDD1CTRL[LVL2] level
 *  0b11..Selects LDOVDD1VSEL[VSEL3] and LVDVDD1CTRL[LVL3] level
 */
#define PMC_PDRUNCFG0_LDO1_VSEL(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_LDO1_VSEL_SHIFT)) & PMC_PDRUNCFG0_LDO1_VSEL_MASK)

#define PMC_PDRUNCFG0_LDO2_MODE_MASK             (0xC0000U)
#define PMC_PDRUNCFG0_LDO2_MODE_SHIFT            (18U)
/*! LDO2_MODE - LDO VDD2 Mode
 *  0b00..Bypass mode
 *  0b01..High-power mode
 *  0b10, 0b11..Low-power mode
 */
#define PMC_PDRUNCFG0_LDO2_MODE(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_LDO2_MODE_SHIFT)) & PMC_PDRUNCFG0_LDO2_MODE_MASK)

#define PMC_PDRUNCFG0_LDO2_VSEL_MASK             (0x300000U)
#define PMC_PDRUNCFG0_LDO2_VSEL_SHIFT            (20U)
/*! LDO2_VSEL - Select LDO VDD2 Voltage
 *  0b00..Selects LDOVDD2VSEL[VSEL0] and LVDVDD2CTRL[LVL0] level
 *  0b01..Selects LDOVDD2VSEL[VSEL1] and LVDVDD2CTRL[LVL1] level
 *  0b10..Selects LDOVDD2VSEL[VSEL2] and LVDVDD2CTRL[LVL2] level
 *  0b11..Selects LDOVDD2VSEL[VSEL3] and LVDVDD2CTRL[LVL3] level
 */
#define PMC_PDRUNCFG0_LDO2_VSEL(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_LDO2_VSEL_SHIFT)) & PMC_PDRUNCFG0_LDO2_VSEL_MASK)

#define PMC_PDRUNCFG0_RBB1_PD_MASK               (0x400000U)
#define PMC_PDRUNCFG0_RBB1_PD_SHIFT              (22U)
/*! RBB1_PD - Power Down RBB in VDD1
 *  0b0..If PDRUNCFG0[AFBB1_PD] = 1, power on. Else power down
 *  0b1..Power down
 */
#define PMC_PDRUNCFG0_RBB1_PD(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_RBB1_PD_SHIFT)) & PMC_PDRUNCFG0_RBB1_PD_MASK)

#define PMC_PDRUNCFG0_AFBB1_PD_MASK              (0x800000U)
#define PMC_PDRUNCFG0_AFBB1_PD_SHIFT             (23U)
/*! AFBB1_PD - Power Down AFBB in VDD1 Domain
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDRUNCFG0_AFBB1_PD(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_AFBB1_PD_SHIFT)) & PMC_PDRUNCFG0_AFBB1_PD_MASK)

#define PMC_PDRUNCFG0_RBB2_PD_MASK               (0x1000000U)
#define PMC_PDRUNCFG0_RBB2_PD_SHIFT              (24U)
/*! RBB2_PD - Power Down RBB in VDD2 Domain
 *  0b0..If PDRUNCFG0[AFBB2_PD] = 1, power on. Else power down
 *  0b1..Power down
 */
#define PMC_PDRUNCFG0_RBB2_PD(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_RBB2_PD_SHIFT)) & PMC_PDRUNCFG0_RBB2_PD_MASK)

#define PMC_PDRUNCFG0_AFBB2_PD_MASK              (0x2000000U)
#define PMC_PDRUNCFG0_AFBB2_PD_SHIFT             (25U)
/*! AFBB2_PD - Power Down AFBB in VDD2 Domain
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDRUNCFG0_AFBB2_PD(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_AFBB2_PD_SHIFT)) & PMC_PDRUNCFG0_AFBB2_PD_MASK)

#define PMC_PDRUNCFG0_RBBN_PD_MASK               (0x4000000U)
#define PMC_PDRUNCFG0_RBBN_PD_SHIFT              (26U)
/*! RBBN_PD - Power Down RBB in VDDN Domain
 *  0b0..If PDRUNCFG0[AFBBN_PD] = 1, power on. Else power down
 *  0b1..Power down
 */
#define PMC_PDRUNCFG0_RBBN_PD(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_RBBN_PD_SHIFT)) & PMC_PDRUNCFG0_RBBN_PD_MASK)

#define PMC_PDRUNCFG0_AFBBN_PD_MASK              (0x8000000U)
#define PMC_PDRUNCFG0_AFBBN_PD_SHIFT             (27U)
/*! AFBBN_PD - Power Down AFBB in VDDN Domain
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDRUNCFG0_AFBBN_PD(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_AFBBN_PD_SHIFT)) & PMC_PDRUNCFG0_AFBBN_PD_MASK)

#define PMC_PDRUNCFG0_RBBSR1_PD_MASK             (0x10000000U)
#define PMC_PDRUNCFG0_RBBSR1_PD_SHIFT            (28U)
/*! RBBSR1_PD - Power Down SRAM RBB in VDD1 Domain
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDRUNCFG0_RBBSR1_PD(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_RBBSR1_PD_SHIFT)) & PMC_PDRUNCFG0_RBBSR1_PD_MASK)

#define PMC_PDRUNCFG0_RBBSR2_PD_MASK             (0x20000000U)
#define PMC_PDRUNCFG0_RBBSR2_PD_SHIFT            (29U)
/*! RBBSR2_PD - Power Down SRAM RBB in VDD2 Domain
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDRUNCFG0_RBBSR2_PD(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_RBBSR2_PD_SHIFT)) & PMC_PDRUNCFG0_RBBSR2_PD_MASK)
/*! @} */

/*! @name PDRUNCFG1 - PD Run Configuration 1 in Compute Domain */
/*! @{ */

#define PMC_PDRUNCFG1_TEMP_PD_MASK               (0x1U)
#define PMC_PDRUNCFG1_TEMP_PD_SHIFT              (0U)
/*! TEMP_PD - Power Down PMC Temperature Sensor
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDRUNCFG1_TEMP_PD(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG1_TEMP_PD_SHIFT)) & PMC_PDRUNCFG1_TEMP_PD_MASK)

#define PMC_PDRUNCFG1_PMCREF_LP_MASK             (0x2U)
#define PMC_PDRUNCFG1_PMCREF_LP_SHIFT            (1U)
/*! PMCREF_LP - PMC References in Low-Power Mode
 *  0b0..Sets PMC references in high-power mode
 *  0b1..Sets PMC references in low-power mode if not overridden by any *_PD bits
 */
#define PMC_PDRUNCFG1_PMCREF_LP(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG1_PMCREF_LP_SHIFT)) & PMC_PDRUNCFG1_PMCREF_LP_MASK)

#define PMC_PDRUNCFG1_HVD1V8_PD_MASK             (0x4U)
#define PMC_PDRUNCFG1_HVD1V8_PD_SHIFT            (2U)
/*! HVD1V8_PD - HVD Power Down
 *  0b0..Power on. In this case, PMC references will be in high-power mode
 *  0b1..Power down
 */
#define PMC_PDRUNCFG1_HVD1V8_PD(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG1_HVD1V8_PD_SHIFT)) & PMC_PDRUNCFG1_HVD1V8_PD_MASK)

