Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_PMC.h
#define PMC_PDRUNCFG2_SRAM4_MASK                 (0x10U)
#define PMC_PDRUNCFG2_SRAM4_SHIFT                (4U)
/*! SRAM4 - Power Down RAM Partition 4 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM4(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM4_SHIFT)) & PMC_PDRUNCFG2_SRAM4_MASK)

#define PMC_PDRUNCFG2_SRAM5_MASK                 (0x20U)
#define PMC_PDRUNCFG2_SRAM5_SHIFT                (5U)
/*! SRAM5 - Power Down RAM Partition 5 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM5(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM5_SHIFT)) & PMC_PDRUNCFG2_SRAM5_MASK)

#define PMC_PDRUNCFG2_SRAM6_MASK                 (0x40U)
#define PMC_PDRUNCFG2_SRAM6_SHIFT                (6U)
/*! SRAM6 - Power Down RAM Partition 6 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM6(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM6_SHIFT)) & PMC_PDRUNCFG2_SRAM6_MASK)

#define PMC_PDRUNCFG2_SRAM7_MASK                 (0x80U)
#define PMC_PDRUNCFG2_SRAM7_SHIFT                (7U)
/*! SRAM7 - Power Down RAM Partition 7 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM7(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM7_SHIFT)) & PMC_PDRUNCFG2_SRAM7_MASK)

#define PMC_PDRUNCFG2_SRAM8_MASK                 (0x100U)
#define PMC_PDRUNCFG2_SRAM8_SHIFT                (8U)
/*! SRAM8 - Power Down RAM Partition 8 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM8(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM8_SHIFT)) & PMC_PDRUNCFG2_SRAM8_MASK)

#define PMC_PDRUNCFG2_SRAM9_MASK                 (0x200U)
#define PMC_PDRUNCFG2_SRAM9_SHIFT                (9U)
/*! SRAM9 - Power Down RAM Partition 9 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM9(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM9_SHIFT)) & PMC_PDRUNCFG2_SRAM9_MASK)

#define PMC_PDRUNCFG2_SRAM10_MASK                (0x400U)
#define PMC_PDRUNCFG2_SRAM10_SHIFT               (10U)
/*! SRAM10 - Power Down RAM Partition 10 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM10(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM10_SHIFT)) & PMC_PDRUNCFG2_SRAM10_MASK)

#define PMC_PDRUNCFG2_SRAM11_MASK                (0x800U)
#define PMC_PDRUNCFG2_SRAM11_SHIFT               (11U)
/*! SRAM11 - Power Down RAM Partition 11 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM11(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM11_SHIFT)) & PMC_PDRUNCFG2_SRAM11_MASK)

#define PMC_PDRUNCFG2_SRAM12_MASK                (0x1000U)
#define PMC_PDRUNCFG2_SRAM12_SHIFT               (12U)
/*! SRAM12 - Power Down RAM Partition 12 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM12(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM12_SHIFT)) & PMC_PDRUNCFG2_SRAM12_MASK)

#define PMC_PDRUNCFG2_SRAM13_MASK                (0x2000U)
#define PMC_PDRUNCFG2_SRAM13_SHIFT               (13U)
/*! SRAM13 - Power Down RAM Partition 13 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM13(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM13_SHIFT)) & PMC_PDRUNCFG2_SRAM13_MASK)

#define PMC_PDRUNCFG2_SRAM14_MASK                (0x4000U)
#define PMC_PDRUNCFG2_SRAM14_SHIFT               (14U)
/*! SRAM14 - Power Down RAM Partition 14 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM14(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM14_SHIFT)) & PMC_PDRUNCFG2_SRAM14_MASK)

#define PMC_PDRUNCFG2_SRAM15_MASK                (0x8000U)
#define PMC_PDRUNCFG2_SRAM15_SHIFT               (15U)
/*! SRAM15 - Power Down RAM Partition 15 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM15(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM15_SHIFT)) & PMC_PDRUNCFG2_SRAM15_MASK)

#define PMC_PDRUNCFG2_SRAM16_MASK                (0x10000U)
#define PMC_PDRUNCFG2_SRAM16_SHIFT               (16U)
/*! SRAM16 - Power Down RAM Partition 16 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM16(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM16_SHIFT)) & PMC_PDRUNCFG2_SRAM16_MASK)

#define PMC_PDRUNCFG2_SRAM17_MASK                (0x20000U)
#define PMC_PDRUNCFG2_SRAM17_SHIFT               (17U)
/*! SRAM17 - Power Down RAM Partition 17 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM17(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM17_SHIFT)) & PMC_PDRUNCFG2_SRAM17_MASK)

#define PMC_PDRUNCFG2_SRAM18_MASK                (0x40000U)
#define PMC_PDRUNCFG2_SRAM18_SHIFT               (18U)
/*! SRAM18 - Power Down RAM Partition 18 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM18(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM18_SHIFT)) & PMC_PDRUNCFG2_SRAM18_MASK)

#define PMC_PDRUNCFG2_SRAM19_MASK                (0x80000U)
#define PMC_PDRUNCFG2_SRAM19_SHIFT               (19U)
/*! SRAM19 - Power Down RAM Partition 19 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM19(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM19_SHIFT)) & PMC_PDRUNCFG2_SRAM19_MASK)

