Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_PMC.h
#define PMC_PDRUNCFG2_SRAM20_MASK                (0x100000U)
#define PMC_PDRUNCFG2_SRAM20_SHIFT               (20U)
/*! SRAM20 - Power Down RAM Partition 20 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM20(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM20_SHIFT)) & PMC_PDRUNCFG2_SRAM20_MASK)

#define PMC_PDRUNCFG2_SRAM21_MASK                (0x200000U)
#define PMC_PDRUNCFG2_SRAM21_SHIFT               (21U)
/*! SRAM21 - Power Down RAM Partition 21 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM21(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM21_SHIFT)) & PMC_PDRUNCFG2_SRAM21_MASK)

#define PMC_PDRUNCFG2_SRAM22_MASK                (0x400000U)
#define PMC_PDRUNCFG2_SRAM22_SHIFT               (22U)
/*! SRAM22 - Power Down RAM Partition 22 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM22(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM22_SHIFT)) & PMC_PDRUNCFG2_SRAM22_MASK)

#define PMC_PDRUNCFG2_SRAM23_MASK                (0x800000U)
#define PMC_PDRUNCFG2_SRAM23_SHIFT               (23U)
/*! SRAM23 - Power Down RAM Partition 23 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM23(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM23_SHIFT)) & PMC_PDRUNCFG2_SRAM23_MASK)

#define PMC_PDRUNCFG2_SRAM24_MASK                (0x1000000U)
#define PMC_PDRUNCFG2_SRAM24_SHIFT               (24U)
/*! SRAM24 - Power Down RAM Partition 24 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM24(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM24_SHIFT)) & PMC_PDRUNCFG2_SRAM24_MASK)

#define PMC_PDRUNCFG2_SRAM25_MASK                (0x2000000U)
#define PMC_PDRUNCFG2_SRAM25_SHIFT               (25U)
/*! SRAM25 - Power Down RAM Partition 25 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM25(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM25_SHIFT)) & PMC_PDRUNCFG2_SRAM25_MASK)

#define PMC_PDRUNCFG2_SRAM26_MASK                (0x4000000U)
#define PMC_PDRUNCFG2_SRAM26_SHIFT               (26U)
/*! SRAM26 - Power Down RAM Partition 26 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM26(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM26_SHIFT)) & PMC_PDRUNCFG2_SRAM26_MASK)

#define PMC_PDRUNCFG2_SRAM27_MASK                (0x8000000U)
#define PMC_PDRUNCFG2_SRAM27_SHIFT               (27U)
/*! SRAM27 - Power Down RAM Partition 27 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM27(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM27_SHIFT)) & PMC_PDRUNCFG2_SRAM27_MASK)

#define PMC_PDRUNCFG2_SRAM28_MASK                (0x10000000U)
#define PMC_PDRUNCFG2_SRAM28_SHIFT               (28U)
/*! SRAM28 - Power Down RAM Partition 28 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM28(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM28_SHIFT)) & PMC_PDRUNCFG2_SRAM28_MASK)

#define PMC_PDRUNCFG2_SRAM29_MASK                (0x20000000U)
#define PMC_PDRUNCFG2_SRAM29_SHIFT               (29U)
/*! SRAM29 - Power Down RAM Partition 29 Array
 *  0b0..Array power on, periphery power controlled by PD*CFG3
 *  0b1..Power down
 */
#define PMC_PDRUNCFG2_SRAM29(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG2_SRAM29_SHIFT)) & PMC_PDRUNCFG2_SRAM29_MASK)
/*! @} */

/*! @name PDRUNCFG3 - PD Run Configuration 3 in Compute Domain */
/*! @{ */

#define PMC_PDRUNCFG3_SRAM0_MASK                 (0x1U)
#define PMC_PDRUNCFG3_SRAM0_SHIFT                (0U)
/*! SRAM0 - Power Down RAM Partition 0 Periphery
 *  0b0..Power on when the corresponding array SRAM 0 is 0
 *  0b1..Power down
 */
#define PMC_PDRUNCFG3_SRAM0(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG3_SRAM0_SHIFT)) & PMC_PDRUNCFG3_SRAM0_MASK)

#define PMC_PDRUNCFG3_SRAM1_MASK                 (0x2U)
#define PMC_PDRUNCFG3_SRAM1_SHIFT                (1U)
/*! SRAM1 - Power Down RAM Partition 1 Periphery
 *  0b0..Power on when the corresponding array SRAM 1 is 0.
 *  0b1..Power down
 */
#define PMC_PDRUNCFG3_SRAM1(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG3_SRAM1_SHIFT)) & PMC_PDRUNCFG3_SRAM1_MASK)

#define PMC_PDRUNCFG3_SRAM2_MASK                 (0x4U)
#define PMC_PDRUNCFG3_SRAM2_SHIFT                (2U)
/*! SRAM2 - Power Down RAM Partition 2 Periphery
 *  0b0..Power on when the corresponding array SRAM 2 is 0.
 *  0b1..Power down
 */
#define PMC_PDRUNCFG3_SRAM2(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG3_SRAM2_SHIFT)) & PMC_PDRUNCFG3_SRAM2_MASK)

#define PMC_PDRUNCFG3_SRAM3_MASK                 (0x8U)
#define PMC_PDRUNCFG3_SRAM3_SHIFT                (3U)
/*! SRAM3 - Power Down RAM Partition 3 Periphery
 *  0b0..Power on when the corresponding array SRAM 3 is 0.
 *  0b1..Power down
 */
#define PMC_PDRUNCFG3_SRAM3(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG3_SRAM3_SHIFT)) & PMC_PDRUNCFG3_SRAM3_MASK)

#define PMC_PDRUNCFG3_SRAM4_MASK                 (0x10U)
#define PMC_PDRUNCFG3_SRAM4_SHIFT                (4U)
/*! SRAM4 - Power Down RAM Partition 4 Periphery
 *  0b0..Power on when the corresponding array SRAM 4 is 0.
 *  0b1..Power down
 */
#define PMC_PDRUNCFG3_SRAM4(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG3_SRAM4_SHIFT)) & PMC_PDRUNCFG3_SRAM4_MASK)

#define PMC_PDRUNCFG3_SRAM5_MASK                 (0x20U)
#define PMC_PDRUNCFG3_SRAM5_SHIFT                (5U)
/*! SRAM5 - Power Down RAM Partition 5 Periphery
 *  0b0..Power on when the corresponding array SRAM 5 is 0.
 *  0b1..Power down
 */
#define PMC_PDRUNCFG3_SRAM5(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG3_SRAM5_SHIFT)) & PMC_PDRUNCFG3_SRAM5_MASK)

#define PMC_PDRUNCFG3_SRAM6_MASK                 (0x40U)
#define PMC_PDRUNCFG3_SRAM6_SHIFT                (6U)
/*! SRAM6 - Power Down RAM Partition 6 Periphery
 *  0b0..Power on when the corresponding array SRAM 6 is 0.
 *  0b1..Power down
 */
#define PMC_PDRUNCFG3_SRAM6(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG3_SRAM6_SHIFT)) & PMC_PDRUNCFG3_SRAM6_MASK)

#define PMC_PDRUNCFG3_SRAM7_MASK                 (0x80U)
#define PMC_PDRUNCFG3_SRAM7_SHIFT                (7U)
/*! SRAM7 - Power Down RAM Partition 7 Periphery
 *  0b0..Power on when the corresponding array SRAM 7 is 0.
 *  0b1..Power down
 */
#define PMC_PDRUNCFG3_SRAM7(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG3_SRAM7_SHIFT)) & PMC_PDRUNCFG3_SRAM7_MASK)

#define PMC_PDRUNCFG3_SRAM8_MASK                 (0x100U)
#define PMC_PDRUNCFG3_SRAM8_SHIFT                (8U)
/*! SRAM8 - Power Down RAM Partition 8 Periphery
 *  0b0..Power on when the corresponding array SRAM 8 is 0.
 *  0b1..Power down
 */
#define PMC_PDRUNCFG3_SRAM8(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG3_SRAM8_SHIFT)) & PMC_PDRUNCFG3_SRAM8_MASK)

#define PMC_PDRUNCFG3_SRAM9_MASK                 (0x200U)
#define PMC_PDRUNCFG3_SRAM9_SHIFT                (9U)
/*! SRAM9 - Power Down RAM Partition 9 Periphery
 *  0b0..Power on when the corresponding array SRAM 9 is 0.
 *  0b1..Power down
 */
#define PMC_PDRUNCFG3_SRAM9(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG3_SRAM9_SHIFT)) & PMC_PDRUNCFG3_SRAM9_MASK)

