Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_PMC.h
#define PMC_PDRUNCFG3_SRAM10_MASK                (0x400U)
#define PMC_PDRUNCFG3_SRAM10_SHIFT               (10U)
/*! SRAM10 - Power Down RAM Partition 10 Periphery
 *  0b0..Power on when the corresponding array SRAM 10 is 0.
 *  0b1..Power down
 */
#define PMC_PDRUNCFG3_SRAM10(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG3_SRAM10_SHIFT)) & PMC_PDRUNCFG3_SRAM10_MASK)

#define PMC_PDRUNCFG3_SRAM11_MASK                (0x800U)
#define PMC_PDRUNCFG3_SRAM11_SHIFT               (11U)
/*! SRAM11 - Power Down RAM Partition 11 Periphery
 *  0b0..Power on when the corresponding array SRAM 11 is 0.
 *  0b1..Power down
 */
#define PMC_PDRUNCFG3_SRAM11(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG3_SRAM11_SHIFT)) & PMC_PDRUNCFG3_SRAM11_MASK)

#define PMC_PDRUNCFG3_SRAM12_MASK                (0x1000U)
#define PMC_PDRUNCFG3_SRAM12_SHIFT               (12U)
/*! SRAM12 - Power Down RAM Partition 12 Periphery
 *  0b0..Power on when the corresponding array SRAM 12 is 0.
 *  0b1..Power down
 */
#define PMC_PDRUNCFG3_SRAM12(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG3_SRAM12_SHIFT)) & PMC_PDRUNCFG3_SRAM12_MASK)

#define PMC_PDRUNCFG3_SRAM13_MASK                (0x2000U)
#define PMC_PDRUNCFG3_SRAM13_SHIFT               (13U)
/*! SRAM13 - Power Down RAM Partition 13 Periphery
 *  0b0..Power on when the corresponding array SRAM 13 is 0.
 *  0b1..Power down
 */
#define PMC_PDRUNCFG3_SRAM13(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG3_SRAM13_SHIFT)) & PMC_PDRUNCFG3_SRAM13_MASK)

#define PMC_PDRUNCFG3_SRAM14_MASK                (0x4000U)
#define PMC_PDRUNCFG3_SRAM14_SHIFT               (14U)
/*! SRAM14 - Power Down RAM Partition 14 Periphery
 *  0b0..Power on when the corresponding array SRAM 14 is 0.
 *  0b1..Power down
 */
#define PMC_PDRUNCFG3_SRAM14(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG3_SRAM14_SHIFT)) & PMC_PDRUNCFG3_SRAM14_MASK)

#define PMC_PDRUNCFG3_SRAM15_MASK                (0x8000U)
#define PMC_PDRUNCFG3_SRAM15_SHIFT               (15U)
/*! SRAM15 - Power Down RAM Partition 15 Periphery
 *  0b0..Power on when the corresponding array SRAM 15 is 0.
 *  0b1..Power down
 */
#define PMC_PDRUNCFG3_SRAM15(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG3_SRAM15_SHIFT)) & PMC_PDRUNCFG3_SRAM15_MASK)

#define PMC_PDRUNCFG3_SRAM16_MASK                (0x10000U)
#define PMC_PDRUNCFG3_SRAM16_SHIFT               (16U)
/*! SRAM16 - Power Down RAM Partition 16 Periphery
 *  0b0..Power on when the corresponding array SRAM 16 is 0.
 *  0b1..Power down
 */
#define PMC_PDRUNCFG3_SRAM16(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG3_SRAM16_SHIFT)) & PMC_PDRUNCFG3_SRAM16_MASK)

#define PMC_PDRUNCFG3_SRAM17_MASK                (0x20000U)
#define PMC_PDRUNCFG3_SRAM17_SHIFT               (17U)
/*! SRAM17 - Power Down RAM Partition 17 Periphery
 *  0b0..Power on when the corresponding array SRAM 17 is 0.
 *  0b1..Power down
 */
#define PMC_PDRUNCFG3_SRAM17(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG3_SRAM17_SHIFT)) & PMC_PDRUNCFG3_SRAM17_MASK)

#define PMC_PDRUNCFG3_SRAM18_MASK                (0x40000U)
#define PMC_PDRUNCFG3_SRAM18_SHIFT               (18U)
/*! SRAM18 - Power Down RAM Partition 18 Periphery
 *  0b0..Power on when the corresponding array SRAM 18 is 0.
 *  0b1..Power down
 */
#define PMC_PDRUNCFG3_SRAM18(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG3_SRAM18_SHIFT)) & PMC_PDRUNCFG3_SRAM18_MASK)

#define PMC_PDRUNCFG3_SRAM19_MASK                (0x80000U)
#define PMC_PDRUNCFG3_SRAM19_SHIFT               (19U)
/*! SRAM19 - Power Down RAM Partition 19 Periphery
 *  0b0..Power on when the corresponding array SRAM 19 is 0.
 *  0b1..Power down
 */
#define PMC_PDRUNCFG3_SRAM19(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG3_SRAM19_SHIFT)) & PMC_PDRUNCFG3_SRAM19_MASK)

#define PMC_PDRUNCFG3_SRAM20_MASK                (0x100000U)
#define PMC_PDRUNCFG3_SRAM20_SHIFT               (20U)
/*! SRAM20 - Power Down RAM Partition 20 Periphery
 *  0b0..Power on when the corresponding array SRAM 20 is 0.
 *  0b1..Power down
 */
#define PMC_PDRUNCFG3_SRAM20(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG3_SRAM20_SHIFT)) & PMC_PDRUNCFG3_SRAM20_MASK)

#define PMC_PDRUNCFG3_SRAM21_MASK                (0x200000U)
#define PMC_PDRUNCFG3_SRAM21_SHIFT               (21U)
/*! SRAM21 - Power Down RAM Partition 21 Periphery
 *  0b0..Power on when the corresponding array SRAM 21 is 0.
 *  0b1..Power down
 */
#define PMC_PDRUNCFG3_SRAM21(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG3_SRAM21_SHIFT)) & PMC_PDRUNCFG3_SRAM21_MASK)

#define PMC_PDRUNCFG3_SRAM22_MASK                (0x400000U)
#define PMC_PDRUNCFG3_SRAM22_SHIFT               (22U)
/*! SRAM22 - Power Down RAM Partition 22 Periphery
 *  0b0..Power on when the corresponding array SRAM 22 is 0.
 *  0b1..Power down
 */
#define PMC_PDRUNCFG3_SRAM22(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG3_SRAM22_SHIFT)) & PMC_PDRUNCFG3_SRAM22_MASK)

#define PMC_PDRUNCFG3_SRAM23_MASK                (0x800000U)
#define PMC_PDRUNCFG3_SRAM23_SHIFT               (23U)
/*! SRAM23 - Power Down RAM Partition 23 Periphery
 *  0b0..Power on when the corresponding array SRAM 23 is 0.
 *  0b1..Power down
 */
#define PMC_PDRUNCFG3_SRAM23(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG3_SRAM23_SHIFT)) & PMC_PDRUNCFG3_SRAM23_MASK)

#define PMC_PDRUNCFG3_SRAM24_MASK                (0x1000000U)
#define PMC_PDRUNCFG3_SRAM24_SHIFT               (24U)
/*! SRAM24 - Power Down RAM Partition 24 Periphery
 *  0b0..Power on when the corresponding array SRAM 24 is 0.
 *  0b1..Power down
 */
#define PMC_PDRUNCFG3_SRAM24(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG3_SRAM24_SHIFT)) & PMC_PDRUNCFG3_SRAM24_MASK)

#define PMC_PDRUNCFG3_SRAM25_MASK                (0x2000000U)
#define PMC_PDRUNCFG3_SRAM25_SHIFT               (25U)
/*! SRAM25 - Power Down RAM Partition 25 Periphery
 *  0b0..Power on when the corresponding array SRAM 25 is 0.
 *  0b1..Power down
 */
#define PMC_PDRUNCFG3_SRAM25(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG3_SRAM25_SHIFT)) & PMC_PDRUNCFG3_SRAM25_MASK)

