Masmiseim36/nxpSDK/devices/MIMXRT735S/periph/PERI_PMC.h
#define PMC_PDSLEEPCFG3_SRAM5_MASK               (0x20U)
#define PMC_PDSLEEPCFG3_SRAM5_SHIFT              (5U)
/*! SRAM5 - RAM Partition 5 Periphery Power Down
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG3_SRAM5(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM5_SHIFT)) & PMC_PDSLEEPCFG3_SRAM5_MASK)

#define PMC_PDSLEEPCFG3_SRAM6_MASK               (0x40U)
#define PMC_PDSLEEPCFG3_SRAM6_SHIFT              (6U)
/*! SRAM6 - RAM Partition 6 Periphery Power Down
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG3_SRAM6(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM6_SHIFT)) & PMC_PDSLEEPCFG3_SRAM6_MASK)

#define PMC_PDSLEEPCFG3_SRAM7_MASK               (0x80U)
#define PMC_PDSLEEPCFG3_SRAM7_SHIFT              (7U)
/*! SRAM7 - RAM Partition 7 Periphery Power Down
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG3_SRAM7(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM7_SHIFT)) & PMC_PDSLEEPCFG3_SRAM7_MASK)

#define PMC_PDSLEEPCFG3_SRAM8_MASK               (0x100U)
#define PMC_PDSLEEPCFG3_SRAM8_SHIFT              (8U)
/*! SRAM8 - RAM Partition 8 Periphery Power Down
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG3_SRAM8(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM8_SHIFT)) & PMC_PDSLEEPCFG3_SRAM8_MASK)

#define PMC_PDSLEEPCFG3_SRAM9_MASK               (0x200U)
#define PMC_PDSLEEPCFG3_SRAM9_SHIFT              (9U)
/*! SRAM9 - RAM Partition 9 Periphery Power Down
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG3_SRAM9(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM9_SHIFT)) & PMC_PDSLEEPCFG3_SRAM9_MASK)

#define PMC_PDSLEEPCFG3_SRAM10_MASK              (0x400U)
#define PMC_PDSLEEPCFG3_SRAM10_SHIFT             (10U)
/*! SRAM10 - RAM Partition 10 Periphery Power Down
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG3_SRAM10(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM10_SHIFT)) & PMC_PDSLEEPCFG3_SRAM10_MASK)

#define PMC_PDSLEEPCFG3_SRAM11_MASK              (0x800U)
#define PMC_PDSLEEPCFG3_SRAM11_SHIFT             (11U)
/*! SRAM11 - RAM Partition 11 Periphery Power Down
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG3_SRAM11(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM11_SHIFT)) & PMC_PDSLEEPCFG3_SRAM11_MASK)

#define PMC_PDSLEEPCFG3_SRAM12_MASK              (0x1000U)
#define PMC_PDSLEEPCFG3_SRAM12_SHIFT             (12U)
/*! SRAM12 - RAM Partition 12 Periphery Power Down
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG3_SRAM12(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM12_SHIFT)) & PMC_PDSLEEPCFG3_SRAM12_MASK)

#define PMC_PDSLEEPCFG3_SRAM13_MASK              (0x2000U)
#define PMC_PDSLEEPCFG3_SRAM13_SHIFT             (13U)
/*! SRAM13 - RAM Partition 13 Periphery Power Down
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG3_SRAM13(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM13_SHIFT)) & PMC_PDSLEEPCFG3_SRAM13_MASK)

#define PMC_PDSLEEPCFG3_SRAM14_MASK              (0x4000U)
#define PMC_PDSLEEPCFG3_SRAM14_SHIFT             (14U)
/*! SRAM14 - RAM Partition 14 Periphery Power Down
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG3_SRAM14(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM14_SHIFT)) & PMC_PDSLEEPCFG3_SRAM14_MASK)

#define PMC_PDSLEEPCFG3_SRAM15_MASK              (0x8000U)
#define PMC_PDSLEEPCFG3_SRAM15_SHIFT             (15U)
/*! SRAM15 - RAM Partition 15 Periphery Power Down
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG3_SRAM15(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM15_SHIFT)) & PMC_PDSLEEPCFG3_SRAM15_MASK)

#define PMC_PDSLEEPCFG3_SRAM16_MASK              (0x10000U)
#define PMC_PDSLEEPCFG3_SRAM16_SHIFT             (16U)
/*! SRAM16 - RAM Partition 16 Periphery Power Down
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG3_SRAM16(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM16_SHIFT)) & PMC_PDSLEEPCFG3_SRAM16_MASK)

#define PMC_PDSLEEPCFG3_SRAM17_MASK              (0x20000U)
#define PMC_PDSLEEPCFG3_SRAM17_SHIFT             (17U)
/*! SRAM17 - RAM Partition 17 Periphery Power Down
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG3_SRAM17(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM17_SHIFT)) & PMC_PDSLEEPCFG3_SRAM17_MASK)

#define PMC_PDSLEEPCFG3_SRAM18_MASK              (0x40000U)
#define PMC_PDSLEEPCFG3_SRAM18_SHIFT             (18U)
/*! SRAM18 - RAM Partition 18 Periphery Power Down
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG3_SRAM18(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM18_SHIFT)) & PMC_PDSLEEPCFG3_SRAM18_MASK)

#define PMC_PDSLEEPCFG3_SRAM19_MASK              (0x80000U)
#define PMC_PDSLEEPCFG3_SRAM19_SHIFT             (19U)
/*! SRAM19 - RAM Partition 19 Periphery Power Down
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG3_SRAM19(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM19_SHIFT)) & PMC_PDSLEEPCFG3_SRAM19_MASK)

#define PMC_PDSLEEPCFG3_SRAM20_MASK              (0x100000U)
#define PMC_PDSLEEPCFG3_SRAM20_SHIFT             (20U)
/*! SRAM20 - RAM Partition 20 Periphery Power Down
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG3_SRAM20(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM20_SHIFT)) & PMC_PDSLEEPCFG3_SRAM20_MASK)

#define PMC_PDSLEEPCFG3_SRAM21_MASK              (0x200000U)
#define PMC_PDSLEEPCFG3_SRAM21_SHIFT             (21U)
/*! SRAM21 - RAM Partition 21 Periphery Power Down
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG3_SRAM21(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM21_SHIFT)) & PMC_PDSLEEPCFG3_SRAM21_MASK)

#define PMC_PDSLEEPCFG3_SRAM22_MASK              (0x400000U)
#define PMC_PDSLEEPCFG3_SRAM22_SHIFT             (22U)
/*! SRAM22 - RAM Partition 22 Periphery Power Down
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG3_SRAM22(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM22_SHIFT)) & PMC_PDSLEEPCFG3_SRAM22_MASK)

#define PMC_PDSLEEPCFG3_SRAM23_MASK              (0x800000U)
#define PMC_PDSLEEPCFG3_SRAM23_SHIFT             (23U)
/*! SRAM23 - RAM Partition 23 Periphery Power Down
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG3_SRAM23(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM23_SHIFT)) & PMC_PDSLEEPCFG3_SRAM23_MASK)

#define PMC_PDSLEEPCFG3_SRAM24_MASK              (0x1000000U)
#define PMC_PDSLEEPCFG3_SRAM24_SHIFT             (24U)
/*! SRAM24 - RAM Partition 24 Periphery Power Down
 *  0b0..Power on
 *  0b1..Power down
 */
#define PMC_PDSLEEPCFG3_SRAM24(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG3_SRAM24_SHIFT)) & PMC_PDSLEEPCFG3_SRAM24_MASK)

